# ResetLinks Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..ResetLinks Method
AnalyticalModel Class See Also
---
The function is trying to recreate analytical link elements that were deleted by the user.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ResetLinks()
```

Visual Basic
---
```text
Public Sub ResetLinks
```

Visual C++
---
```text
public:
void ResetLinks()
```

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace